#+title: The Hybrid Bootstrap: A Drop-in Replacement for Dropout
#+author: Robert Kosar @@latex:\\@@ David W. Scott
#+options: toc:nil

#+begin_abstract
Regularization is an important component of predictive model building.
The hybrid bootstrap is a regularization technique that functions
similarly to dropout except that features are resampled from other
training points rather than replaced with zeros.  We show that the
hybrid bootstrap offers superior performance to dropout.  We also
present a sampling based technique to simplify hyperparameter choice.
Next, we provide an alternative sampling technique for convolutional
neural networks.  Finally, we demonstrate the efficacy of the hybrid
bootstrap on non-image tasks using tree-based models.  The code used
to generate this paper is available
[[http://github.com/r-kosar/hybrid_bootstrap][here]].
#+end_abstract

* Benchmarks
  <<benchmarks>> The previous sections employed smaller versions of
  the MNIST training digits for the sake of speed, but clearly the
  hybrid bootstrap is only useful if it works for larger datasets and
  for data besides the MNIST digits.  To evaluate the hybrid
  bootstrap's performance on three standard image benchmarks, we adopt
  a gls:cnn architecture very similar to the glspl:wrn of Zagoruyko and
  Komodakis cite:Zagoruyko2016WRN with three major differences.
  First, they applied dropout immediately prior to certain weight
  layers.  Since their network uses skip connections, this means
  difficult regularization patterns can be bypassed, defeating the
  regularization.  We therefore apply the hybrid bootstrap prior to
  each set of network blocks at a particular resolution.  Second, we
  use 160 rather than 16 filters in the initial convolutional layer.
  This allows us to use the same level of hybrid bootstrap for each of
  the three regularization layers. Third, their training schedule
  halted after decreasing the learning rate three times by 80\%.  Our
  version of the network continues to improve significantly at lower
  learning rates, so we decrease by the same amount five times. Our
  architecture is visualized in Figure [[benchmark_architecture]].
  #+name: benchmark_architecture
  #+begin_src python :exports results :results file
    from graphviz import Digraph

    # It would be better if this was generated by the actual code using
    # a parser

    my_graph = Digraph()
    my_graph.attr(ranksep = '0.2')
    my_graph.attr(nodesep = '0.5')
    my_graph.attr('graph', size = '6.5, 6.5', margin = '0')
    my_graph.attr('node', shape = 'rect')
    my_graph.attr('edge', weight = '2')


    my_graph.node('0', 'Image', style = 'filled', fillcolor = 'grey')
    my_graph.node('1', 'Convolution Layer, 160 3x3 Filters', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('2', 'Spatial Grid Hybrid Bootstrap, u = 0.45', style = 'filled', fillcolor = 'forestgreen')
    my_graph.node('3', 'Residual Junction Block, filters = 160', style = 'filled', fillcolor = 'white')
    my_graph.node('4', '<[Residual Block, filters = 160]<sup>3</sup>>', style = 'filled', fillcolor = 'white')
    my_graph.node('5', 'Spatial Grid Hybrid Bootstrap, u = 0.45', style = 'filled', fillcolor = 'forestgreen')
    my_graph.node('6', 'Residual Junction Block, filters = 320', style = 'filled', fillcolor = 'white')
    my_graph.node('7', '<[Wide Residual Block, filters = 320]<sup>3</sup>>', style = 'filled', fillcolor = 'white')
    my_graph.node('8', 'Spatial Grid Hybrid Bootstrap, u = 0.45', style = 'filled', fillcolor = 'forestgreen')
    my_graph.node('9', 'Wide Residual Junction Block, filters = 640', style = 'filled', fillcolor = 'white')
    my_graph.node('10', '<[Wide Residual Block, filters = 640]<sup>3</sup>>', style = 'filled', fillcolor = 'white')
    my_graph.node('11', 'Spatial Batch Normalization', style = 'filled', fillcolor = 'blueviolet')
    my_graph.node('12', 'ReLU Activation', style = 'filled', fillcolor = 'red')
    my_graph.node('13', 'Spatial Global Average Pooling', style = 'filled', fillcolor = 'deepskyblue1')
    my_graph.node('14', 'Softmax Layer', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('15', 'Class Probabilities', style = 'filled', fillcolor = 'grey')

    for i in range(15):
        my_graph.edge(str(i), str(i + 1))

    my_graph.node('24', 'Residual Block, filters = #filters', style = 'filled', fillcolor = 'white')
    my_graph.node('25', 'Input', style = 'filled', fillcolor = 'grey')
    my_graph.node('26', 'Spatial Batch Normalization', style = 'filled', fillcolor = 'blueviolet')
    my_graph.node('27', 'ReLU Activation', style = 'filled', fillcolor = 'red')
    my_graph.node('28', 'Convolution Layer, #filters 3x3 Filters', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('29', 'Spatial Batch Normalization', style = 'filled', fillcolor = 'blueviolet')
    my_graph.node('30', 'ReLU Activation', style = 'filled', fillcolor = 'red')
    my_graph.node('31', 'Convolution Layer, #filters 3x3 Filters', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('32', '+', style = 'filled', fillcolor = 'white', shape = 'circle')


    for i in range(25, 32):
        my_graph.edge(str(i), str(i + 1))

    my_graph.edge(str(24), str(25), style = 'invis')
    my_graph.edge(str(25), str(32))

    my_graph.node('33', 'Residual Junction Block, filters = #filters', style = 'filled', fillcolor = 'white')
    my_graph.node('34', 'Input', style = 'filled', fillcolor = 'grey')
    my_graph.node('35', 'Spatial Batch Normalization', style = 'filled', fillcolor = 'blueviolet')
    my_graph.node('36', 'ReLU Activation', style = 'filled', fillcolor = 'red')
    my_graph.node('37', 'Convolution Layer, #filters 1x1 Filters, Stride = 2', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('38', 'Convolution Layer, #filters 3x3 Filters, Stride = 2', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('39', 'Spatial Batch Normalization', style = 'filled', fillcolor = 'blueviolet')
    my_graph.node('40', 'ReLU Activation', style = 'filled', fillcolor = 'red')
    my_graph.node('41', 'Convolution Layer, #filters 3x3 Filters', style = 'filled', fillcolor = 'blanchedalmond')
    my_graph.node('42', '+', style = 'filled', fillcolor = 'white', shape = 'circle')



    my_graph.edge(str(33), str(34), style = 'invis')
    my_graph.edge(str(34), str(35))
    my_graph.edge(str(35), str(36))
    my_graph.edge(str(36), str(37))
    my_graph.edge(str(36), str(38))
    for i in range(38, 42):
        my_graph.edge(str(i), str(i + 1))

    my_graph.edge(str(37), str(42))

    my_graph.render('./benchmark_network', view = False)
    return './benchmark_network.pdf'
  #+end_src
  #+caption: Network architecture for benchmark results.  Biases are not used.  All convolutional layers have linear activations.
  #+caption:  Exponents represent the number of repeated layers.
  #+label: benchmark_architecture
  #+attr_latex: :width 0.9\textwidth
  #+RESULTS: benchmark_architecture
  [[file:./benchmark_network.pdf]] 

  We test this network on the CIFAR10 and CIFAR100 datasets, which
  consist of RGB images with 50,000 training examples and 10,000 test
  cases each and 10 and 100 classes respectively
  cite:krizhevsky2009learning.  We also evaluate this network on the
  MNIST digits. We augment the CIFAR data with 15\% translations and
  horizontal flips.  We do not use data augmentation for the MNIST
  digits. The images are preprocessed by centering and scaling
  according to the channel-wise mean and standard deviation of the
  training data.  We use gls:sgd with Nesterov momentum 0.9 and start
  with learning rate 0.1.  The learning rate is decreased by 80\%
  every 60 epochs and the network is trained for 360 epochs total.
  The results are given in Table [[benchmark_table]].  We attempted to use
  dropout in the same position as we use the hybrid bootstrap, but
  this worked very poorly.  At dropout levels $p = 0.5$ and $p =
  0.25$, the misclassification rates on the CIFAR100 test set are
  src_python[:exports results :var x = wide_resnet_dropout_cifar100_bench :results raw]{return(x)}\% and
  src_python[:exports results :var x = wide_resnet_less_dropout_cifar100_bench :results raw]{return(x)}\%
  respectively, which is much worse than the hybrid bootstrap result.  To
  have a real comparison to dropout, we have included the
  dropout-based results from the original wide residual network paper.
  It is apparent in Table [[benchmark_table]] that adding the hybrid
  bootstrap in our location makes a much bigger difference than adding
  dropout to the residual blocks.

  #+name: channels_first_hb_conv
  #+begin_src python :exports none
    import numpy as np
    from keras import backend as K
    from theano import tensor as T
    from keras.engine.topology import Layer
    from keras.initializers import Constant

    # Theano has much faster batch normalization if
    # data format is channels first.

    def hybo_2d_conv(x, p, shift, seed = None, unif = True, just_dropout = False):
        '''Theano hybrid bootstrap backend'''
        if p.get_value() < 0. or p.get_value() > 1:
            raise Exception('Hybrid bootstrap p must be in interval [0, 1].')
        if seed is None:
            seed = np.random.randint(1, 10e6)
            rng = K.RandomStreams(seed = seed)
        if(unif == True):
            retain_prob = 1. - rng.uniform((x.shape[0],), 0, p, dtype = x.dtype)
            for dim in range(x.ndim - 1):
                retain_prob = K.expand_dims(retain_prob, dim + 1)
        else:
            retain_prob = 1. - p
        mask = rng.binomial((x.shape[0], 1, x.shape[2], x.shape[3]), p=retain_prob, dtype=x.dtype)
        mask = T.extra_ops.repeat(mask, x.shape[1], axis = 1)
        if just_dropout:
            x = x * mask / retain_prob
        else:
            x = x * mask + (1 - mask) * T.roll(x, shift = shift, axis = 0)
        return x



    class HB_2d_conv(Layer):
        '''Applies the hybrid bootstrap to the input.
            # Arguments
            p: float between 0 and 1. Fraction of the input units to resample if unif = F,
               maximum fraction if unif = T
            shift: int. Should be smaller than batch size.
            unif: bool.  Should p be sampled from unif(0, p)?
            just_dropout: Should we just do dropout?
            '''
        def __init__(self, p, shift, unif = True, just_dropout = False, **kwargs):
            self.init_p = p
            self.shift = shift
            self.unif = unif
            self.just_dropout = just_dropout
            self.uses_learning_phase = True
            self.supports_masking = True
            super(HB_2d_conv, self).__init__(**kwargs)
        def build(self, input_shape):
            self.p = self.add_weight(shape=(),
                                     name = 'p',
                                     initializer=Constant(value = self.init_p),
                                     trainable=False)
            super(HB_2d_conv, self).build(input_shape)
        def call(self, x, mask=None):
            if 0. < self.p.get_value() < 1.:
                x = K.in_train_phase(hybo_2d_conv(x, p = self.p, shift = self.shift,
                                          unif = self.unif,
                                          just_dropout = self.just_dropout), x)
            return x
        def get_config(self):
            config = {'init_p': self.init_p, 'p': self.p, 'shift': self.shift,
                      'unif': self.unif, 'just_dropout': self.just_dropout}
            base_config = super(HB_2d_conv, self).get_config()
            return dict(list(base_config.items()) + list(config.items()))

  #+end_src
  #+name:wide_resnet_cifar100_bench
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar100
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar100.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    hb1 = HB_2d_conv(hbp, shift = -1)(exp)
    block1 = build_resnet_block(hb1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    hb2 = HB_2d_conv(hbp, shift = -2)(block1)
    block2 = build_resnet_block(hb2, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    hb3 = HB_2d_conv(hbp, shift = -3)(block2)
    block3 = build_resnet_block(hb3, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[da46a2f06789207e800b767c8049030d1a786154]: wide_resnet_cifar100_bench
  : 18.36

  #+name:wide_resnet_cifar10_bench
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar10
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar10.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    hb1 = HB_2d_conv(hbp, shift = -1)(exp)
    block1 = build_resnet_block(hb1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    hb2 = HB_2d_conv(hbp, shift = -2)(block1)
    block2 = build_resnet_block(hb2, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    hb3 = HB_2d_conv(hbp, shift = -3)(block2)
    block3 = build_resnet_block(hb3, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[9fc0245db595f828d08f043a651df93545639195]: wide_resnet_cifar10_bench
  : 3.4

  #+name:wide_resnet_mnist_bench
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import mnist
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
               x = np.array(x, dtype = 'float32')
               lr = np.piecewise(x,
                                 [x <= 60,
                                  (x > 60) & (x <= 120),
                                  (x > 120) & (x <= 180),
                                  (x > 180) & (x <= 240),
                                  (x > 240) & (x <= 300),
                                  x > 300],
                                 [0.1,
                                  0.1 * 0.2,
                                  0.1 * 0.2 ** 2,
                                  0.1 * 0.2 ** 3,
                                  0.1 * 0.2 ** 4,
                                  0.1 * 0.2 ** 5])
               return(float(lr))
    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = mnist.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]

    X_train_s = X_train_s.reshape(X_train_s.shape[0], img_rows, img_cols, 1)
    X_test = X_test.reshape(X_test.shape[0], img_rows, img_cols, 1)

    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 1))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 1))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(1, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    hb1 = HB_2d_conv(hbp, shift = -1)(exp)
    block1 = build_resnet_block(hb1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    hb2 = HB_2d_conv(hbp, shift = -2)(block1)
    block2 = build_resnet_block(hb2, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    hb3 = HB_2d_conv(hbp, shift = -3)(block2)
    block3 = build_resnet_block(hb3, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(7, 7), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit(X_train_s, Y_train_s,
                    batch_size = batch_size,
                    epochs = 360,
                    verbose = 1, validation_data = (X_test, Y_test),
                    callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[bb75a19140b001ff85adef7f0b0218a9e3de7770]: wide_resnet_mnist_bench
  : 0.3

  #+name:wide_resnet_dropout_cifar100_bench
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input, Dropout
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar100
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar100.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    drop1 = Dropout(0.5)(exp)
    block1 = build_resnet_block(drop1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    drop2 = Dropout(0.5)(block1)
    block2 = build_resnet_block(drop2, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    drop3 = Dropout(0.5)(block2)
    block3 = build_resnet_block(drop3, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[4dc86460558ed3bb550f7cc2ccbd103d9ab82501]: wide_resnet_dropout_cifar100_bench
  : 50.56

  #+name:wide_resnet_less_dropout_cifar100_bench
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input, Dropout
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar100
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar100.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    drop1 = Dropout(0.25)(exp)
    block1 = build_resnet_block(drop1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    drop2 = Dropout(0.25)(block1)
    block2 = build_resnet_block(drop2, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    drop3 = Dropout(0.25)(block2)
    block3 = build_resnet_block(drop3, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[7a2ce1ac6464f24c197bc9cb4cb60963b9a7d874]: wide_resnet_less_dropout_cifar100_bench
  : 28.83

  #+name:wide_resnet_cifar100_bench_no_stoch_reg
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar100
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar100.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    block1 = build_resnet_block(exp, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    block2 = build_resnet_block(block1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    block3 = build_resnet_block(block2, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[74b919d88ea1c46c1a0cf290d0493f58d743c225]: wide_resnet_cifar100_bench_no_stoch_reg
  : 20.1

  #+name:wide_resnet_cifar10_bench_no_stoch_reg
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import cifar10
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
        x = np.array(x, dtype = 'float32')
        lr = np.piecewise(x,[x <= 60,
                             (x > 60) & (x <= 120),
                             (x > 120) & (x <= 180),
                             (x > 180) & (x <= 240),
                             (x > 240) & (x <= 300),
                             x > 300],
                          [0.1,
                           0.1 * 0.2,
                           0.1 * 0.2 ** 2,
                           0.1 * 0.2 ** 3,
                           0.1 * 0.2 ** 4,
                           0.1 * 0.2 ** 5])
        return(float(lr))

    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = cifar10.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]
    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 3))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(3, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    block1 = build_resnet_block(exp, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    block2 = build_resnet_block(block1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    block3 = build_resnet_block(block2, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(8, 8), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    datagen = ImageDataGenerator(width_shift_range = 0.15,
                                 height_shift_range = 0.15,
                                 zoom_range = 0.0,
                                 rotation_range = 0,
                                 horizontal_flip = True,
                                 fill_mode='reflect',
                                 data_format = data_format)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit_generator(datagen.flow(X_train_s, Y_train_s,
                                           batch_size = batch_size),
                              steps_per_epoch = np.ceil(1. * X_train_s.shape[0] / batch_size),
                              epochs = 360,
                              verbose = 1, validation_data = (X_test, Y_test),
                              callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[0b3f3a1fd63d0993e0ede3772bb243e5496adbde]: wide_resnet_cifar10_bench_no_stoch_reg
  : 4.13

  #+name:wide_resnet_mnist_bench_no_stoch_reg
  #+begin_src python :exports none :noweb yes :cache yes :results value
    import numpy as np
    np.random.seed(42)  # for reproducibility
    from keras.layers import Dense, Flatten
    from keras.layers.convolutional import Conv2D
    from keras.layers.pooling import AveragePooling2D
    from keras.utils import np_utils
    from keras.optimizers import SGD
    from keras.preprocessing.image import ImageDataGenerator
    from keras.layers.normalization import BatchNormalization
    from keras.preprocessing.image import ImageDataGenerator
    from keras.models import Model
    from keras.layers import Input
    from keras.layers.merge import add, concatenate
    from keras import regularizers
    from keras import backend as K
    from keras.layers import Lambda
    from keras.datasets import mnist
    from keras.callbacks import LearningRateScheduler

    <<channels_first_hb_conv>>

    def schedule(x):
               x = np.array(x, dtype = 'float32')
               lr = np.piecewise(x,
                                 [x <= 60,
                                  (x > 60) & (x <= 120),
                                  (x > 120) & (x <= 180),
                                  (x > 180) & (x <= 240),
                                  (x > 240) & (x <= 300),
                                  x > 300],
                                 [0.1,
                                  0.1 * 0.2,
                                  0.1 * 0.2 ** 2,
                                  0.1 * 0.2 ** 3,
                                  0.1 * 0.2 ** 4,
                                  0.1 * 0.2 ** 5])
               return(float(lr))
    optimizer_schedule = LearningRateScheduler(schedule)
    batch_size = 128
    nb_epoch = 360
    hbp = 0.45
    wd = 0.0005
    nb_filters = 160
    nb_conv = 3

    (X_train_s, y_train_s), (X_test, y_test) = mnist.load_data()
    img_rows = X_train_s.shape[1]
    img_cols = X_train_s.shape[2]

    X_train_s = X_train_s.reshape(X_train_s.shape[0], img_rows, img_cols, 1)
    X_test = X_test.reshape(X_test.shape[0], img_rows, img_cols, 1)

    nb_classes = np.max(y_train_s) + 1

    train_mean = np.mean(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 1))
    train_sd = np.std(X_train_s, axis = (0, 1, 2)).reshape((1, 1, 1, 1))

    X_train_s = (X_train_s - train_mean) / train_sd
    X_test = (X_test - train_mean) / train_sd

    # Change to channels first format for Theano
    X_train_s = np.moveaxis(X_train_s, [1, 2, 3], [2, 3, 1])
    X_test = np.moveaxis(X_test, [1, 2, 3], [2, 3, 1])

    X_train_s = X_train_s.astype('float32')
    X_test = X_test.astype('float32')

    # convert class vectors to binary class matrices
    Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
    Y_test = np_utils.to_categorical(y_test, nb_classes)

    def rectifier(x):
        return K.relu(x)

    def build_resnet_block(inp, nb_reps = 1, nb_conv = 3, nb_filters = 32,
                           hbp = 0.01, wd = 0.0001, stride = 1,
                           data_format = None):
        through = BatchNormalization(axis = 1)(inp)
        through = Lambda(rectifier)(through)
        skip = Conv2D(nb_filters, kernel_size = (1, 1), padding = 'same',
                      strides = (stride, stride), kernel_regularizer = regularizers.l2(wd),
                      use_bias = False, data_format = data_format)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (stride, stride),
                         kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        through = BatchNormalization(axis = 1)(through)
        through = Lambda(rectifier)(through)
        through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                         padding = 'same',
                         strides = (1, 1), kernel_regularizer = regularizers.l2(wd),
                         use_bias = False, data_format = data_format)(through)
        inp = add([through, skip])
        for i in range(nb_reps):
            through = BatchNormalization(axis = 1)(inp)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv), padding = 'same',
                             kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            through = BatchNormalization(axis = 1)(through)
            through = Lambda(rectifier)(through)
            through = Conv2D(nb_filters, kernel_size = (nb_conv, nb_conv),
                             padding = 'same', kernel_regularizer = regularizers.l2(wd),
                             use_bias = False, data_format = data_format)(through)
            inp = add([through, inp])
        return(inp)

    data_format = "channels_first"

    inp = Input(shape=(1, img_rows, img_cols))
    exp = Conv2D(filters = 160,
                 kernel_size = (nb_conv, nb_conv),
                 padding = 'same',
                 kernel_regularizer = regularizers.l2(wd),
                 data_format = data_format,
                 use_bias = False)(inp)
    block1 = build_resnet_block(exp, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = nb_filters,
                                hbp = hbp, wd = wd, data_format = data_format)
    block2 = build_resnet_block(block1, nb_reps = 3, nb_conv = nb_conv,
                                nb_filters = 2 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    block3 = build_resnet_block(block2, nb_reps = 3,
                                nb_conv = nb_conv, nb_filters = 4 * nb_filters,
                                hbp = hbp, wd = wd, stride = 2,
                                data_format = data_format)
    bn_pre_pool = BatchNormalization(axis = 1)(block3)
    rectifier_pre_pool = Lambda(rectifier)(bn_pre_pool)
    pool = AveragePooling2D(pool_size=(7, 7), data_format = data_format)(rectifier_pre_pool)
    flat = Flatten()(pool)
    dense = Dense(nb_classes, activation = 'softmax',
                   kernel_regularizer = regularizers.l2(wd),
                  use_bias = False)(flat)
    model = Model(inputs = inp, outputs = dense)

    sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = True)
    model.compile(loss = 'categorical_crossentropy',
                  optimizer = sgd,
                  metrics=['accuracy'])

    fit = model.fit(X_train_s, Y_train_s,
                    batch_size = batch_size,
                    epochs = 360,
                    verbose = 1, validation_data = (X_test, Y_test),
                    callbacks = [optimizer_schedule])

    return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
  #+end_src

  #+RESULTS[38ce3805a006ea626b82eec1f4cb28ef111ce4d6]: wide_resnet_mnist_bench_no_stoch_reg
  : 0.66


  #+name: insert
  #+begin_src python :var x="" :exports none
    return(x)
  #+end_src

  #+caption: Benchmark results.  Values are misclassification percentages.
  #+caption: The CIFAR datasets are augmented with translations and flips.  The MNIST
  #+caption: digits are not augmented.
  #+caption: @@latex:\\@@   
  #+attr_latex: :align c|cccc
  #+name: benchmark_table
  | Dataset  |   Hybrid Bootstrap | No Stochastic Reg. | Dropout                  | No Stochastic Reg.       |
  |          | (Our Architecture) | (Our Architecture) | (gls:wrn 28-10)          | (gls:wrn 28-10)          |
  | /        |<                   |                    |                          |   >                      |
  |----------+--------------------+--------------------+--------------------------+--------------------------|
  | CIFAR10  |                3.4 |               4.13 | 3.89                     | 4.00                     |
  | CIFAR100 |              18.36 |               20.1 | 18.85                    | 19.25                    |
  | MNIST    |                0.3 |               0.66 | NA                       | NA                       |
  #+tblfm: @4$2 = '(org-sbe "insert" (x "wide_resnet_cifar10_bench")))
  #+tblfm: @5$2 = '(org-sbe "insert" (x "wide_resnet_cifar100_bench")))  
  #+tblfm: @6$2 = '(org-sbe "insert" (x "wide_resnet_mnist_bench")))
  #+tblfm: @4$3 = '(org-sbe "insert" (x "wide_resnet_cifar10_bench_no_stoch_reg")))
  #+tblfm: @5$3 = '(org-sbe "insert" (x "wide_resnet_cifar100_bench_no_stoch_reg")))  
  #+tblfm: @6$3 = '(org-sbe "insert" (x "wide_resnet_mnist_bench_no_stoch_reg")))

** Multilayer Perceptron
   #+name: mlp_hb
   #+begin_src python :exports none :noweb yes :cache yes :results value
     import numpy as np
     np.random.seed(42)  # for reproducibility
     from keras.datasets import mnist
     from keras.models import Sequential
     from keras.layers import Dense, Dropout, Flatten
     from keras.utils import np_utils
     from keras.optimizers import SGD
     from keras import regularizers
     from keras.callbacks import LearningRateScheduler

     <<basic_hb>>

     def schedule(x):
           x = np.array(x, dtype = 'float32')
           lr = np.piecewise(x,
                             [x <= 250,
                              (x > 250) & (x <= 500),
                              (x > 500) & (x <= 750),
                              x > 750],
                             [0.1,
                              0.1 * 0.2,
                              0.1 * 0.2 ** 2,
                              0.1 * 0.2 ** 3])
           return(float(lr))

     optimizer_schedule = LearningRateScheduler(schedule)

     batch_size = 512
     nb_classes = 10
     wd = 0.00001

     # input image dimensions
     img_rows, img_cols = 28, 28

     # the data, shuffled and split between train and test sets
     (X_train_s, y_train_s), (X_test, y_test) = mnist.load_data()

     X_train_s = X_train_s.astype('float32')
     X_test = X_test.astype('float32')
     X_train_s /= 255
     X_test /= 255

     # convert class vectors to binary class matrices
     Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
     Y_test = np_utils.to_categorical(y_test, nb_classes)

     model = Sequential()
     model.add(Flatten(input_shape = (img_rows, img_cols)))
     model.add(HB(0.225, shift = -1))
     model.add(Dense(8192, activation = 'relu', kernel_regularizer = regularizers.l2(wd)))
     model.add(HB(0.45, shift = -2))
     model.add(Dense(8192, activation = 'relu', kernel_regularizer = regularizers.l2(wd)))
     model.add(Dense(nb_classes, activation = 'softmax',
                     kernel_regularizer = regularizers.l2(wd)))
     sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = False)
     model.compile(loss = 'categorical_crossentropy',
                   optimizer = sgd,
                   metrics = ['accuracy'])
     fit = model.fit(X_train_s, Y_train_s, batch_size = batch_size, epochs = 1000,
                     verbose = 1, validation_data = (X_test, Y_test),
                     callbacks = [optimizer_schedule])

     return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
   #+end_src

   #+RESULTS[9b50646efc11a2c3a2b9e3763b0b965c0afaf051]: mlp_hb
   : 0.81

   #+name: mlp_drop
   #+begin_src python :exports none :noweb yes :cache yes :results value
     import numpy as np
     np.random.seed(42)  # for reproducibility
     from keras.datasets import mnist
     from keras.models import Sequential
     from keras.layers import Dense, Dropout, Flatten
     from keras.utils import np_utils
     from keras.optimizers import SGD
     from keras import regularizers
     from keras.callbacks import LearningRateScheduler

     def schedule(x):
           x = np.array(x, dtype = 'float32')
           lr = np.piecewise(x,
                             [x <= 250,
                              (x > 250) & (x <= 500),
                              (x > 500) & (x <= 750),
                              x > 750],
                             [0.1,
                              0.1 * 0.2,
                              0.1 * 0.2 ** 2,
                              0.1 * 0.2 ** 3])
           return(float(lr))

     optimizer_schedule = LearningRateScheduler(schedule)

     batch_size = 512
     nb_classes = 10
     wd = 0.00001

     # input image dimensions
     img_rows, img_cols = 28, 28

     # the data, shuffled and split between train and test sets
     (X_train_s, y_train_s), (X_test, y_test) = mnist.load_data()

     X_train_s = X_train_s.astype('float32')
     X_test = X_test.astype('float32')
     X_train_s /= 255
     X_test /= 255

     # convert class vectors to binary class matrices
     Y_train_s = np_utils.to_categorical(y_train_s, nb_classes)
     Y_test = np_utils.to_categorical(y_test, nb_classes)

     model = Sequential()
     model.add(Flatten(input_shape = (img_rows, img_cols)))
     model.add(Dropout(0.25))
     model.add(Dense(8192, activation = 'relu', kernel_regularizer = regularizers.l2(wd)))
     model.add(Dropout(0.5))
     model.add(Dense(8192, activation = 'relu', kernel_regularizer = regularizers.l2(wd)))
     model.add(Dense(nb_classes, activation = 'softmax',
                     kernel_regularizer = regularizers.l2(wd)))
     sgd = SGD(lr = 0.1, momentum = 0.9, decay = 0.00, nesterov = False)
     model.compile(loss = 'categorical_crossentropy',
                   optimizer = sgd,
                   metrics = ['accuracy'])
     fit = model.fit(X_train_s, Y_train_s, batch_size = batch_size, epochs = 1000,
                     verbose = 1, validation_data = (X_test, Y_test),
                     callbacks = [optimizer_schedule])

     return(format(100 * (1 - fit.history['val_acc'][-1]), '.2f'))
   #+end_src

   #+RESULTS[18d1d31eefa9c9efb3195006a0f9fec445ec9c6c]: mlp_drop
   : 1.06


   The multilayer perceptron is not of tremendous modern interest for
   image classification, but it is still an effective model for other
   tasks.  Dropout is commonly used to regularize the multilayer
   perceptron, but the hybrid bootstrap is even more effective.  As an
   example, we train a multilayer perceptron on the MNIST digits with
   2 ``hidden'' layers of $2^{13}$ neurons each with gls:relu
   activations and $u = 0.225$, $u = 0.45$ hybrid bootstrap
   regularization for each layer respectively.  We use weight decay
   0.00001 and gls:sgd with momentum 0.9 and batch size 512.  We start
   the learning rate at 0.1 and multiply it by 0.2 every 250 epochs
   for 1,000 epochs total training.  The resulting network has error
   src_python[:exports results :var x = mlp_hb :results raw]{return(x)}\%
   on the MNIST test set.  Srivastava et al. used
   dropout on the same architecture with resulting error 0.95\%
   cite:srivastava2014dropout.  However, their training schedule was
   different and they used a max-norm constraint rather than weight
   decay.  To verify that this improvement is not simply a consequence
   of these differences rather than the result of replacing dropout
   with the hybrid bootstrap, we use the same parameters but replace
   the hybrid bootstrap with dropout $p = 0.25$, $p = 0.5$
   respectively.  The resulting network has test set error
   src_python[:exports results :var x = mlp_drop :results raw]{return(x)}\%.

